import React from "react";
import { Link } from "react-router-dom";


const Post = ({ cover, title, author, createdAt, summary }) => {
    return (
        <div className="post">
            <div className="image">
                <Link>
                    <img src="https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5LI9dNZLCUw8mz6RMUBsHVduL3JjicmWDxASByWyChy2rRVZs8b.webp" alt='' />
                </Link>
            </div>
            <div className="text">
                <Link>
                <h2>{title}</h2>
                    <h2> ไอซ์ ลุ้นประกันบ่ายนี้ ชี้หากส่งเรือนจำหลุด สส.ทันที ตามรัฐธรรมนูญ </h2>
                    <h5> วันที่ 13 ธ.ค. 66 นายชัยธวัช ตุลาธน หัวหน้าพรรคก้าวไกล เปิดเผย ภายหลังรับฟังคำพิพากษาในคดีที่ ศาลอาญามีคำพิพากษาจำคุก 6 ปี ไม่รอลงอาญา นางสาวรักชนก ศรีนอก หรือ ไอซ์ สมาชิก </h5>
                </Link>
                <p className="info">
                    <a href="https://www.thairath.co.th/news/local/bangkok/2747511" className="author ">
                        Athiphong
                    </a>
                    <time> {formatISO09075(new DataTransfer(createdAt), "dd MM yyy HH:MM")} </time>
                </p>
                <p className="หัวหน้าพรรคก้าวไกล ใช้ตำแหน่งพร้อมหลักทรัพย์เงินสด 300,000 บาท ยื่นประกันตัวไอซ์ รักชนก ลุ้นฟังผลประกันตัวบ่ายนี้ ยืนยันเรื่องเกิดก่อนไอซ์เป็นสมาชิกพรรค ชี้มีสิทธิหลุด สส.หากไม่ได้ประกันตัว และถูกส่งเข้าเรือนจำวันนี้
วันที่ 13 ธ.ค. 66 นายชัยธวัช ตุลาธน หัวหน้าพรรคก้าวไกล เปิดเผย ภายหลังรับฟังคำพิพากษาในคดีที่ ศาลอาญามีคำพิพากษาจำคุก 6 ปี ไม่รอลงอาญา นางสาวรักชนก ศรีนอก หรือ ไอซ์ สมาชิกสภาผู้แทนราษฎรกรุงเทพมหานคร พรรคก้าวไกล ในความผิดตามประมวลกฎหมายอาญามาตรา 112 และ พ.ร.บ.คอมพิวเตอร์ฯ ว่า ขณะนี้อยู่ระหว่างการยื่นประกันตัวโดยใช้ตำแหน่งตนเองและหลักทรัพย์เงินสดจำนวน 300,000 บาท ประกอบในการยื่นประกันตัว คาดว่าจะทราบผลการประกันตัวในช่วงบ่ายวันนี้ โดยหลังจากประชุมสภาเสร็จเรียบร้อยแล้วจะเดินทางมาติดตามผลในช่วงบ่ายด้วย ส่วนหลังจากนี้จะยื่นอุทธรณ์หรือไม่ต้องรอฟังผลการขอยื่นประกันตัวก่อน
อย่างไรก็ตาม นายชัยธวัช ยืนยันว่า คดีนี้เกิดขึ้นก่อนที่นางสาวรักชนกจะเข้ามาเป็นสมาชิกสภาผู้แทนราษฎรของพรรคก้าวไกล ทางพรรคไม่ได้มีส่วนเกี่ยวข้องในการเข้าไปต่อสู้คดีตั้งแต่ต้น แต่เป็นเรื่องของทนายความ เมื่อศาลมีคำพิพากษาออกมาแล้วก็จะต้องยอมรับปฏิบัติตามนั้น และยังคงต้องให้นางสาวรักชนกได้ใช้สิทธิ์ในกระบวนการยุติธรรมอีกเต็มที่ในอีกสองศาลที่เหลือ 
ส่วนท่าที นางสาวรักชนก หลังได้รับฟังคำพิพากษานั้น นายชัยธวัช กล่าวว่า ไม่ได้มีความกังวลอะไร เนื่องจากกระบวนการยังไม่ถึงที่สุด
สำหรับคดีนี้ หลังต้องคำพิพากษาที่สุด จำคุก เจ้าหน้าที่ได้นำตัวจำเลยไว้ในห้องควบคุมใต้ถุนศาล เพื่อส่งเข้ารับโทษในเรือนจำ กรณีที่ไม่ได้รับการประกันตัว หรือหากศาลสั่งให้ส่งศาลอุทธรณ์พิจารณา แล้วออกหมายจำคุกส่งตัวไปเรือนจำ ซึ่งตามกฎหมายจะเริ่มนับวันจำคุก เข้าข่ายรัฐธรรมนูญมาตรา 101 ส่งผลให้พ้นสมาชิกภาพการเป็น สส. ทันที">

                </p>
            </div>
        </div>
    )
}
export default Post;